Ran Plan for 2 projects:

1. dir: `ec2` workspace: `default`
1. dir: `.` workspace: `default`
---

### 1. dir: `ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0e3c763f8580b0e1b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web will be created
+ resource "aws_instance" "web" {
+       ami                                  = "ami-0e3c763f8580b0e1b"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Env"  = "sandbox"
+           "Name" = "terraform-atlantis"
        }
+       tags_all                             = {
+           "Env"  = "sandbox"
+           "Name" = "terraform-atlantis"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

  # aws_instance.web-02 will be created
+ resource "aws_instance" "web-02" {
+       ami                                  = "ami-0e3c763f8580b0e1b"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Env"  = "sandbox"
+           "Name" = "terraform-atlantis-02"
        }
+       tags_all                             = {
+           "Env"  = "sandbox"
+           "Name" = "terraform-atlantis-02"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d ec2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.albertsuwandhi.cloud/lock?id=albertsuwandhi%252Fterraform-atlantis%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d ec2
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `default`
**Plan Error**
```
running "/atlantis-data/bin/terraform1.4.6 plan -input=false -refresh -out \"/atlantis-data/repos/albertsuwandhi/terraform-atlantis/2/default/default.tfplan\"" in "/atlantis-data/repos/albertsuwandhi/terraform-atlantis/2/default": exit status 1
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

```

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```